[
  {
    "id": "68c319968b3b93c11de27a97",
    "projTitle": "Testaurant",
    "img1": "https://i.imgur.com/lI9zvko.png",
    "img2": "https://i.imgur.com/TLjLKzB.png",
    "img3": "https://i.imgur.com/mzFYYtg.png",
    "description": "Testaurant is an application designed to help restaurant employees learn about menu items and to help employers keep their employees accountable. In depth lesson plans with visual aids can be created by employers that can help employees learn about menu items, products offered, company policies and more. Employers will also have the ability to create customizable tests that their employees can take with an array of question formats, such as \"multiple choice\", \"select all that apply\", \"fill in the blanks\", \"true or false\" and \"open ended\". Their scores will be logged for viewability between the employee and management through the use of personalized accounts made by the users. Users of Testaurant will also have the ability to add any items they wish to a searchable database of their offerings to aid them in accomodating guests with specific needs, or for educational purposes. The goal is to help shine some light on the gaps of knowledge that may exist within a company, and to close those gaps as they are discovered.",
    "finishDate": "08/11/2025",
    "startDate": "10/2022",
    "link1": "https://github.com/hewinsonj/Testaurant-Front-end",
    "link2": "https://github.com/hewinsonj/Testaurant-Back-end",
    "link3": "https://testaurantapp.netlify.app/",
    "role": "Solo Developer",
    "client": "React, Semantic UI, Axios, Django, PostgreSQL, Python, JavaScript",
    "progress": 100,
    "priority": "a",
    "private": false
  },
  {
    "id": "689ab8d58b3b93c11de27a47",
    "projTitle": "VisualLife",
    "img1": "https://i.imgur.com/9uYJTzs.png",
    "img2": "https://i.imgur.com/1UErbAd.png",
    "img3": "https://i.imgur.com/13ZW2aj.png",
    "description": "VisualLife is an experimental, interactive art tool designed to blur the line between digital play and creative expression, with the potential to be used as a live performance instrument or centerpiece for interactive art installations. The original version was powered by THREE.js with a sprawling HTML/CSS/JavaScript interface, driving dynamic 3D objects, custom shaders, and camera systems in an immersive, reactive environment. In the refactored version, I’m rebuilding the experience on a modern foundation—React, Vite, React-Three-Fiber, and @react-three/drei—with plans to integrate Zustand for state management, Camera-Controls for fluid navigation, and modular shader systems for more flexible, real-time visual effects. This new architecture will make it easier to expand VisualLife into responsive performance tools, gallery-ready installations, or even collaborative online experiences.",
    "finishDate": "07/11/2025",
    "startDate": "03/05/2025",
    "link1": "",
    "link2": "https://github.com/hewinsonj/VisualLife",
    "link3": "https://hewinsonj.github.io/VisualLife/",
    "role": "Solo Developer",
    "client": "JavaScript, THREE.js, HTML, CSS",
    "progress": 50,
    "priority": "d",
    "private": false
  },
  {
    "id": "689ab0a88b3b93c11de27a23",
    "projTitle": "Space Chaser 8 Bit Game",
    "img1": "https://i.imgur.com/dc5iJTA.png",
    "img2": "https://i.imgur.com/0ub60X7.png",
    "img3": "https://i.imgur.com/fEy0FyH.png",
    "description": "Space Chaser is a frantic 2D browser game where you play as an astronaut guard racing to round up alien prisoners before they escape a cosmic detention yard. Intercept runaways and use power-ups to outmaneuver crafty extraterrestrials as they change routes mid-chase. The game’s fluid sprite animations, frame-rate–independent controls, and state-based movement systems let prisoners switch between behaviors like running, waiting, and escaping. A centralized game state synchronizes character positions, collision detection, and timed events, keeping gameplay smooth and consistent across devices. Built with HTML5 Canvas and JavaScript.",
    "finishDate": "07/11/2025",
    "startDate": "03/05/2025",
    "link1": "https://github.com/hewinsonj/SpaceChaser-Game",
    "link2": "https://github.com/hewinsonj/SpaceChaser-Game",
    "link3": "https://hewinsonj.github.io/SpaceChaser-Game/",
    "role": "Solo Developer",
    "client": "JavaScript, Canvas.js, HTML, CSS",
    "progress": 100,
    "priority": "d",
    "private": false
  },
  {
    "id": "660fae6e9afadd253363992d",
    "projTitle": "MyTiki App",
    "img1": "https://i.imgur.com/JvpDQwM.jpg",
    "img2": "https://i.imgur.com/GWkVhJO.jpg",
    "img3": "https://i.imgur.com/Dl1jz05.jpg",
    "description": "\"MyTiki\" is an app that provides classic tiki cocktail recipes that are available to be viewed by any logged in user. The user is also able to customize any of the provided recipes and add them to their own \"original cocktails\" folder, or create their own from scratch! The user also has the ability to filter the shown cocktails by keywords, and add any cocktails they wish to their \"favorites\" folder.",
    "finishDate": "10/22",
    "startDate": "10/22",
    "link1": "https://github.com/hewinsonj/MyTikiAPP",
    "link2": "https://github.com/hewinsonj/MyTikiAPP",
    "link3": "https://mytikiapp.fly.dev/",
    "role": "Solo Dev",
    "client": "HTML5, CSS, Bootstrap, JavaScript, LiquidJs, Express, MongoDB, Mongoose, Morgan, Bcryptjs",
    "progress": 0,
    "priority": "b",
    "private": false
  },
  {
    "id": "660fadcf21b01ed4fba6665f",
    "projTitle": "Honey Badges",
    "img1": "https://i.imgur.com/xpmhf0o.png",
    "img2": "https://i.imgur.com/0liwpQe.png",
    "img3": "https://i.imgur.com/rHz1pkJ.png",
    "description": "Honey Badges is an application where users can keep a running list of activites to complete and earn \"badges\" for completing multiple activites of the same type. Together, users form a community of badge-earners who can opt to share their accomplishments and use eachother's activities for inspiration. We hope the social aspect of creating and sharing activities will motivate users in a positive way. At the same time, users will have the option to make specific activities on their tasklist private. Users who need some help getting started can also choose to randomly generate an activity within specified parameters.",
    "finishDate": "11/22",
    "startDate": "10/22",
    "link1": "https://github.com/hewinsonj/HoneyBadgersClient",
    "link2": "https://github.com/hewinsonj/HoneyBadgersAppAPI",
    "link3": "https://honeybadges.netlify.app/",
    "role": "Front End Dev",
    "client": "Node, Express, Mongoose, Axios, MongoDB, React, Bootstrap, Semantic, Javascript, HTML, CSS",
    "progress": 0,
    "priority": "a",
    "private": false
  }
]